In [1]:
# This notebook expects that Modin and Ray are installed, e.g. by `pip install modin[ray]`.
# For all ways to install Modin see official documentation at:
# https://modin.readthedocs.io/en/latest/installation.html
import modin.pandas as pd
import pandas
from timeit import default_timer as timer

In [2]:
columns_names = [

    "trip_id", "vendor_id", "pickup_datetime", "dropoff_datetime", "store_and_fwd_flag",
        "rate_code_id", "pickup_longitude", "pickup_latitude", "dropoff_longitude", "dropoff_latitude",
        "passenger_count", "trip_distance", "fare_amount", "extra", "mta_tax", "tip_amount",
        "tolls_amount", "ehail_fee", "improvement_surcharge", "total_amount", "payment_type",
        "trip_type", "pickup", "dropoff", "cab_type", "precipitation", "snow_depth", "snowfall",
        "max_temperature", "min_temperature", "average_wind_speed", "pickup_nyct2010_gid",
        "pickup_ctlabel", "pickup_borocode", "pickup_boroname", "pickup_ct2010",
        "pickup_boroct2010", "pickup_cdeligibil", "pickup_ntacode", "pickup_ntaname", "pickup_puma",
        "dropoff_nyct2010_gid", "dropoff_ctlabel", "dropoff_borocode", "dropoff_boroname",
        "dropoff_ct2010", "dropoff_boroct2010", "dropoff_cdeligibil", "dropoff_ntacode",
        "dropoff_ntaname", "dropoff_puma",
    ]
parse_dates=["pickup_datetime", "dropoff_datetime"]

In [3]:
# We should provide a justification why Modin is faster/slower than pandas
t0 = timer()
modin_df = pd.read_csv('s3://modin-datasets/taxi/trips_xaa_5M.csv', names=columns_names, header=None, parse_dates=parse_dates)
t1 = timer()
print("Modin time:", t1 - t0)
t0 = timer()
pandas_df = pandas.read_csv('s3://modin-datasets/taxi/trips_xaa_5M.csv', names=columns_names, header=None, parse_dates=parse_dates)
t1 = timer()
print("pandas time:", t1 - t0)

UserWarning: Ray execution environment not yet initialized. Initializing...
To remove this warning, run the following python code before doing dataframe operations:

    import ray
    ray.init()

UserWarning: Not all Ray Dashboard dependencies were found. To use the dashboard please install Ray using `pip install ray[default]`. To disable this message, set RAY_DISABLE_IMPORT_WARNING env var to '1'.

Modin time: 195.48647334426641
pandas time: 438.423446778208

In [4]:
modin_df

,trip_id,vendor_id,pickup_datetime,dropoff_datetime,store_and_fwd_flag,rate_code_id,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,...,dropoff_nyct2010_gid,dropoff_ctlabel,dropoff_borocode,dropoff_boroname,dropoff_ct2010,dropoff_boroct2010,dropoff_cdeligibil,dropoff_ntacode,dropoff_ntaname,dropoff_puma
0,1,2,2013-08-01 08:14:37,2013-08-01 09:09:06,N,1,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,2,2013-08-01 09:13:00,2013-08-01 11:38:00,N,1,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,2,2013-08-01 09:48:00,2013-08-01 09:49:00,N,5,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,2,2013-08-01 10:38:35,2013-08-01 10:38:51,N,1,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,2,2013-08-01 11:51:45,2013-08-01 12:03:52,N,1,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4999995,4999986,2,2014-04-19 23:49:32,2014-04-19 23:54:32,N,1,-73.829720,40.759655,-73.819145,40.766457,...,1087.0,1159.0,4.0,Queens,115900.0,4115900.0,I,QN51,Murray Hill,4103.0
4999996,4999987,2,2014-04-25 23:14:41,2014-04-25 23:26:28,N,1,-73.829750,40.759586,-73.842163,40.783901,...,1035.0,925.0,4.0,Queens,92500.0,4092500.0,E,QN23,College Point,4103.0
4999997,4999988,2,2014-04-14 15:03:51,2014-04-14 15:27:21,N,1,-73.829262,40.759766,-73.913078,40.747658,...,1349.0,169.0,4.0,Queens,16900.0,4016900.0,I,QN31,Hunters Point-Sunnyside-West Maspeth,4109.0
4999998,4999989,2,2014-04-03 01:35:17,2014-04-03 01:41:35,N,1,-73.829758,40.759697,-73.820633,40.765450,...,1085.0,1163.0,4.0,Queens,116300.0,4116300.0,E,QN51,Murray Hill,4103.0
4999999,4999990,2,2014-04-03 17:17:34,2014-04-03 17:19:58,N,1,-73.829750,40.759701,-73.826752,40.760365,...,760.0,853.0,4.0,Queens,85300.0,4085300.0,E,QN22,Flushing,4103.0

In [5]:
pandas_df

,trip_id,vendor_id,pickup_datetime,dropoff_datetime,store_and_fwd_flag,rate_code_id,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,...,dropoff_nyct2010_gid,dropoff_ctlabel,dropoff_borocode,dropoff_boroname,dropoff_ct2010,dropoff_boroct2010,dropoff_cdeligibil,dropoff_ntacode,dropoff_ntaname,dropoff_puma
0,1,2,2013-08-01 08:14:37,2013-08-01 09:09:06,N,1,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,2,2013-08-01 09:13:00,2013-08-01 11:38:00,N,1,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,2,2013-08-01 09:48:00,2013-08-01 09:49:00,N,5,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,2,2013-08-01 10:38:35,2013-08-01 10:38:51,N,1,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,2,2013-08-01 11:51:45,2013-08-01 12:03:52,N,1,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4999995,4999986,2,2014-04-19 23:49:32,2014-04-19 23:54:32,N,1,-73.829720,40.759655,-73.819145,40.766457,...,1087.0,1159.0,4.0,Queens,115900.0,4115900.0,I,QN51,Murray Hill,4103.0
4999996,4999987,2,2014-04-25 23:14:41,2014-04-25 23:26:28,N,1,-73.829750,40.759586,-73.842163,40.783901,...,1035.0,925.0,4.0,Queens,92500.0,4092500.0,E,QN23,College Point,4103.0
4999997,4999988,2,2014-04-14 15:03:51,2014-04-14 15:27:21,N,1,-73.829262,40.759766,-73.913078,40.747658,...,1349.0,169.0,4.0,Queens,16900.0,4016900.0,I,QN31,Hunters Point-Sunnyside-West Maspeth,4109.0
4999998,4999989,2,2014-04-03 01:35:17,2014-04-03 01:41:35,N,1,-73.829758,40.759697,-73.820633,40.765450,...,1085.0,1163.0,4.0,Queens,116300.0,4116300.0,E,QN51,Murray Hill,4103.0
4999999,4999990,2,2014-04-03 17:17:34,2014-04-03 17:19:58,N,1,-73.829750,40.759701,-73.826752,40.760365,...,760.0,853.0,4.0,Queens,85300.0,4085300.0,E,QN22,Flushing,4103.0

In [6]:
def q1(df):
    return df.groupby("cab_type")["cab_type"].count()
def q2(df):
    return df.groupby("passenger_count", as_index=False).mean()[["passenger_count", "total_amount"]]
def q3(df):
    return df.groupby(["passenger_count", "pickup_datetime"]).size().reset_index()
def q4(df):
    transformed = pd.DataFrame({
        "passenger_count": df["passenger_count"],
        "pickup_datetime": df["pickup_datetime"].dt.year,
        "trip_distance": df["trip_distance"].astype("int64"),
    })
    return transformed.groupby(["passenger_count", "pickup_datetime", "trip_distance"])  \
            .size().reset_index().sort_values(by=["pickup_datetime", 0], ascending=[True, False])

In [7]:
# We should provide a justification why Modin is faster/slower than pandas

In [8]:
t0 = timer()
modin_q1_result = q1(modin_df)
t1 = timer()
print("Modin time:", t1 - t0)
t0 = timer()
pandas_q1_result = q1(pandas_df)
t1 = timer()
print("pandas time:", t1 - t0)

Modin time: 0.7333072200417519
pandas time: 0.6914568543434143

In [9]:
modin_q1_result

cab_type
green    5000000
Name: cab_type, dtype: int64

In [10]:
pandas_q1_result

cab_type
green    5000000
Name: cab_type, dtype: int64

In [11]:
t0 = timer()
modin_q2_result = q2(modin_df)
t1 = timer()
print("Modin time:", t1 - t0)
t0 = timer()
pandas_q2_result = q2(pandas_df)
t1 = timer()
print("pandas time:", t1 - t0)

Modin time: 9.099235692992806
pandas time: 3.116944821551442

In [12]:
modin_q2_result

   passenger_count  total_amount
0                0      8.046854
1                1     13.923278
2                2     14.612774
3                3     14.683111
4                4     14.793963
5                5     14.104099
6                6     15.083793
7                7     15.922059
8                8     13.881477
9                9     27.346216

In [13]:
pandas_q2_result

   passenger_count  total_amount
0                0      8.046854
1                1     13.923278
2                2     14.612774
3                3     14.683111
4                4     14.793963
5                5     14.104099
6                6     15.083793
7                7     15.922059
8                8     13.881477
9                9     27.346216

In [14]:
t0 = timer()
modin_q3_result = q3(modin_df)
t1 = timer()
print("Modin time:", t1 - t0)
t0 = timer()
pandas_q3_result = q3(pandas_df)
t1 = timer()
print("pandas time:", t1 - t0)

Modin time: 71.6060786191374
pandas time: 7.657089374959469

In [15]:
modin_q3_result

         passenger_count     pickup_datetime  0
0                      0 2013-08-14 12:07:00  1
1                      0 2013-08-14 12:37:00  1
2                      0 2013-08-15 00:00:00  1
3                      0 2013-09-17 13:30:00  1
4                      0 2013-09-25 17:32:46  1
...                  ...                 ... ..
4334692                9 2014-03-18 00:10:46  1
4334693                9 2014-04-14 16:18:00  1
4334694                9 2014-04-22 18:26:00  1
4334695                9 2014-04-30 12:35:37  1
4334696                9 2014-04-30 17:47:05  1

[4334697 rows x 3 columns]

In [16]:
pandas_q3_result

         passenger_count     pickup_datetime  0
0                      0 2013-08-14 12:07:00  1
1                      0 2013-08-14 12:37:00  1
2                      0 2013-08-15 00:00:00  1
3                      0 2013-09-17 13:30:00  1
4                      0 2013-09-25 17:32:46  1
...                  ...                 ... ..
4334692                9 2014-03-18 00:10:46  1
4334693                9 2014-04-14 16:18:00  1
4334694                9 2014-04-22 18:26:00  1
4334695                9 2014-04-30 12:35:37  1
4334696                9 2014-04-30 17:47:05  1

[4334697 rows x 3 columns]

In [17]:
t0 = timer()
modin_q4_result = q4(modin_df)
t1 = timer()
print("Modin time:", t1 - t0)
t0 = timer()
pandas_q4_result = q4(pandas_df)
t1 = timer()
print("pandas time:", t1 - t0)

UserWarning: Distributing <class 'dict'> object. This may take some time.
UserWarning: sort_values defaulting to pandas implementation.
To request implementation, send an email to feature_requests@modin.org.

Modin time: 4.687446435913444

UserWarning: sort_values defaulting to pandas implementation.

pandas time: 1.4840463008731604

In [18]:
modin_q4_result

     passenger_count  pickup_datetime  trip_distance       0
51                 1             2013              1  274599
50                 1             2013              0  210759
52                 1             2013              2  152696
53                 1             2013              3   96007
54                 1             2013              4   62700
..               ...              ...            ...     ...
632                8             2014             10       1
633                8             2014             35       1
642                9             2014              5       1
644                9             2014              7       1
645                9             2014             18       1

[646 rows x 4 columns]

In [19]:
pandas_q4_result

     passenger_count  pickup_datetime  trip_distance       0
51                 1             2013              1  274599
50                 1             2013              0  210759
52                 1             2013              2  152696
53                 1             2013              3   96007
54                 1             2013              4   62700
..               ...              ...            ...     ...
632                8             2014             10       1
633                8             2014             35       1
642                9             2014              5       1
644                9             2014              7       1
645                9             2014             18       1

[646 rows x 4 columns]